week02-practice/mini-capstone/mini-capstone-api/app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def deadpool_figure
    product = Product.all

SELECT "products".* FROM "products"
---
  def ironman_figure
    product = Product.all

SELECT "products".* FROM "products"
---
  def game
    product = Product.all