week02-practice/mini-capstone/mini-capstone-api/app/controllers/products_controller.rb

  def display_products
    product = Product.all
---
SELECT "products".* FROM "products"

  def find_all
    product = Product.find_by(id: params["id"])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]