week02-practice/contacts-api/app/controllers/contacts_controller.rb

  def contact_one
    contact = Contact.first
---
SELECT "contacts".* FROM "contacts" ORDER BY "contacts"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def contact_all
    contact_array = []
    contacts = Contact.all
    contacts.each do |contact|
---
SELECT "contacts".* FROM "contacts"