week04-practice/Twitter_Decomp/app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params["id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]