week04-practice/auth-api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    pp current_user
    users = User.all

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Clark Kent"], ["email", "clarkkent2@example.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-07-14 21:59:10.256383"], ["updated_at", "2022-07-14 21:59:10.256383"]]
---
  def create
    user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password],
      password_confirmation: params[:password_confirmation],
    )
    if user.save