mini-capstone/mini-capstone-api/app/controllers/carted_products_controller.rb

  def create
    carted_product = CartedProduct.new(
      user_id: current_user.id,
      product_id: params["product_id"],
      quantity: params["quantity"],
      status: "carted",
    )

    if carted_product.save
---
INSERT INTO "carted_products" ("user_id", "product_id", "quantity", "status", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 4], ["product_id", 1], ["quantity", 1], ["status", "carted"], ["order_id", nil], ["created_at", "2022-07-18 19:28:19.450646"], ["updated_at", "2022-07-18 19:28:19.450646"]]

  def destroy
    carted_product = CartedProduct.find_by(id: params["id"])
    carted_product.status = "removed"
    carted_product.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "carted_products".* FROM "carted_products" WHERE "carted_products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "carted_products" SET "status" = $1, "updated_at" = $2 WHERE "carted_products"."id" = $3  [["status", "removed"], ["updated_at", "2022-07-18 19:30:15.654504"], ["id", 5]]