mini-capstone/mini-capstone-api/app/controllers/orders_controller.rb

  def index
    orders = current_user.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 4]]

  def show
    order = current_user.orders.find_by(id: params["id"])
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 6], ["LIMIT", 1]]

  def create
    product = Product.find_by(id: params["product_id"])

    calculated_subtotal = product.price * params["quantity"].to_i
    calculated_tax = calculated_subtotal * 0.09
    calculated_total = calculated_subtotal + calculated_tax

    order = Order.new(
      user_id: current_user.id,
      product_id: params["product_id"],
      quantity: params["quantity"],
      subtotal: calculated_subtotal,
      tax: calculated_tax,
      total: calculated_total,
    )

    if order.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "product_id", "quantity", "subtotal", "tax", "total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    order = Order.find_by(id: params["id"])

    order.destroy
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 16]]