mini-capstone/mini-capstone-api/app/controllers/orders_controller.rb

  def create
    carted_products = current_user.carted_products.where(status: "carted")

    #calculate subtotal
    calculated_subtotal = 0
    carted_products.each do |carted_product|
---
SELECT "carted_products".* FROM "carted_products" WHERE "carted_products"."user_id" = $1 AND "carted_products"."status" = $2  [["user_id", 4], ["status", "carted"]]