mini-capstone/mini-capstone-api/app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @product = Product.find_by(id: params["id"])

INSERT INTO "products" ("name", "price", "image_url", "description", "created_at", "updated_at", "inventory") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @product = Product.new(
      name: params["name"],
      price: params["price"],
      image_url: params["image_url"],
      description: params["description"],
    )
    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "price" = $2, "image_url" = $3, "description" = $4, "updated_at" = $5 WHERE "products"."id" = $6  [["name", "no idea"], ["price", "5.0"], ["image_url", "www.legos.com"], ["description", "tons of pieces of fun"], ["updated_at", "2022-07-08 17:41:59.196205"], ["id", 19]]
---
  def update
    @product = Product.find_by(id: params["id"])

    @product.name = params["name"] || product.name
    @product.price = params["price"] || product.price
    @product.image_url = params["image_url"] || product.image_url
    @product.description = params["description"] || product.description

    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 20]]
---
  def destroy
    product = Product.find_by(id: params["id"])

    product.destroy