mini-capstone/mini-capstone-api/app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    product = Product.all

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_product
    product = Product.find_by(id: params["id"])

INSERT INTO "products" ("name", "price", "image_url", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", nil], ["price", nil], ["image_url", nil], ["description", nil], ["created_at", "2022-07-01 17:56:15.904431"], ["updated_at", "2022-07-01 17:56:15.904431"]]
---
  def create
    product = Product.create(
      name: params["name"],
      price: params["price"],
      image_url: params["image_url"],
      description: params["description"],
    )

UPDATE "products" SET "price" = $1, "image_url" = $2, "description" = $3, "updated_at" = $4 WHERE "products"."id" = $5  [["price", 50], ["image_url", "www.jackinthebox.com"], ["description", "jack in the box toy. pop"], ["updated_at", "2022-07-01 18:50:12.118773"], ["id", 2]]
---
  def update
    product_id = params["id"]
    product = Product.find_by(id: product_id)

    product.name = params["name"] || product.name
    product.price = params["price"] || product.price
    product.image_url = params["image_url"] || product.image_url
    product.description = params["description"] || product.description

    product.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 10]]
---
  def destroy
    product_id = params["id"]
    product = Product.find_by(id: product_id)

    product.destroy