mini-capstone/mini-capstone-api/app/controllers/sessions_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def destroy
    product = Product.find_by(id: params["id"])