mini-capstone/mini-capstone-api/app/controllers/suppliers_controller.rb

  def index
    supplier = Supplier.all
---
SELECT "suppliers".* FROM "suppliers"

  def show
    supplier = Supplier.find_by(id: params["id"])
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]