mini-capstone/mini-capstone-api/app/controllers/users_controller.rb

  def create
    user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password],
      password_confirmation: params[:password_confirmation],
    )
    if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Mark"], ["email", "mark@example.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-07-12 17:22:19.319143"], ["updated_at", "2022-07-12 17:22:19.319143"]]