week03-practice/Favorite_Songs_App/app/controllers/songs_controller.rb

  def index
    songs = Song.all
---
SELECT "songs".* FROM "songs"

  def show
    song = Song.find_by(id: params["id"])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    song = Song.create(
      title: params["title"],
      album: params["album"],
      artist: params["artist"],
      year: params["year"],
    )
---
INSERT INTO "songs" ("title", "album", "artist", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    song = Song.find_by(id: params["id"])

    song.title = params["title"] || song.title
    song.album = params["album"] || song.album
    song.artist = params["artist"] || song.artist
    song.year = params["year"] || song.year

    song.save
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "songs" SET "album" = $1, "artist" = $2, "year" = $3, "updated_at" = $4 WHERE "songs"."id" = $5  [["album", "Mayday Parade"], ["artist", "Mayday Parade"], ["year", "2011"], ["updated_at", "2022-07-05 17:27:57.089387"], ["id", 7]]

  def destroy
    song = Song.find_by(id: params["id"])

    song.destroy
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 8]]