week02-practice/movie-app/app/controllers/actors_controller.rb

SELECT "actors".* FROM "actors"
---
  def index
    actor = Actor.all

SELECT "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    actor = Actor.find_by(id: params["id"])

INSERT INTO "actors" ("first_name", "last_name", "known_for", "created_at", "updated_at", "gender", "age") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["first_name", "Af"], ["last_name", "Kd"], ["known_for", "batman"], ["created_at", "2022-07-12 13:40:46.158400"], ["updated_at", "2022-07-12 13:40:46.158400"], ["gender", nil], ["age", 14]]
---
  def create
    actor = Actor.new(
      first_name: params["first_name"],
      last_name: params["last_name"],
      known_for: params["known_for"],
      gender: params["gender"],
      age: params["age"],
    )
    actor.save

SELECT "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
UPDATE "actors" SET "first_name" = $1, "last_name" = $2, "known_for" = $3, "updated_at" = $4 WHERE "actors"."id" = $5  [["first_name", "clark"], ["last_name", "kent"], ["known_for", "superman"], ["updated_at", "2022-07-07 01:09:53.602242"], ["id", 26]]
---
  def update
    actor = Actor.find_by(id: params["id"])
    actor.first_name = params["first_name"] || actor.first_name
    actor.last_name = params["last_name"] || actor.last_name
    actor.known_for = params["known_for"] || actor.known_for
    actor.gender = params["gender"] || actor.gender
    actor.age = params["age"] || actor.age
    actor.save

SELECT "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
DELETE FROM "actors" WHERE "actors"."id" = $1  [["id", 26]]
---
  def destroy
    actor = Actor.find_by(id: params["id"])
    actor.destroy