week02-practice/movie-app/app/controllers/application_controller.rb

SELECT "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def actors_by_id
    actor = Actor.find_by(id: params["id"])

SELECT "actors".* FROM "actors"
---
  def actors_all
    actor = Actor.all