week02-practice/movie-app/app/controllers/movies_controller.rb

  def by_title
    movie = Movie.where("title LIKE ?", Movie.sanitize_sql_like(params[:title]) + "%")
---
SELECT "movies".* FROM "movies" WHERE (title LIKE 'Top Gun%')

  def by_year
    # movie = Movie.all
    # render json: movie.as_json
    movie = Movie.order(year: :DESC)
---
SELECT "movies".* FROM "movies" ORDER BY "movies"."year" DESC