week02-practice/movie-app/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find_by(id: params["id"])

INSERT INTO "movies" ("title", "year", "plot", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @movie = Movie.new(
      title: params["title"],
      year: params["year"],
      plot: params["plot"],
      director: params["director"],
      english: params["english"],
    )

    if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "movies" SET "title" = $1, "year" = $2, "plot" = $3, "updated_at" = $4 WHERE "movies"."id" = $5
---
  def update
    @movie = Movie.find_by(id: params["id"])
    movie.title = params["title"] || movie.title
    movie.year = params["year"] || movie.year
    movie.plot = params["plot"] || movie.plot
    movie.director = params["director"] || movie.director
    movie.english = params["english"] || movie.english

    if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 8]]
---
  def destroy
    @movie = Movie.find_by(id: params["id"])
    @movie.destroy