week02-practice/movie-app/app/controllers/movie_genres_controller.rb

  def create
    moviegenre = MovieGenre.new(
      movie_id: params["movie_id"],
      genre_id: params["genre_id"],
    )

    if moviegenre.save
---
INSERT INTO "movie_genres" ("genre_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["genre_id", 2], ["movie_id", 1], ["created_at", "2022-07-19 21:17:30.710709"], ["updated_at", "2022-07-19 21:17:30.710709"]]