week02-practice/movie-app/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    user = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    user = User.find_by(id: params["id"])

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "admin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "ken"], ["email", "ken@example.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-07-17 16:56:30.521617"], ["updated_at", "2022-07-17 16:56:30.521617"], ["admin", false]]
---
  def create
    user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password],
      password_confirmation: params[:password_confirmation],
      admin: params[:admin],
    )
    if user.save